package exam;

//클래스 블록
public class hello {
	
	//public : 클래스 혹은 메소드의 접근 제어자
	//         -> 누구나 이 클래스 혹은 메소드에 접근이 가능하다는 의미
	// static : 인스턴트 없이 실행 가능한 함수 정의시 사용
	// void : 리턴값이 없는 메소드
	// String[] : 문자열을 나타내는 자료형.(대괄호의 의미 : 여러개의 값)
	// args : String[]의 변수명.
  public static void main(String[] args) {
	  // 표준출력으로 데이터를 보내는 자바의 내장 메소드
	    //System.out.println("hello java world");
	    
  }
	/*
	 * * 주석(comment) 프로그램에서 실행을 원치 않을때 처리해두는 영역 
	 * 코드에 개발자(프로그래머)의 의견이나 설명을 작성하는 영역 주석이 무조건 좋은것은 아니다 
	 * 주석이 필요 없을정도로 코드를 작 성 할 수 있으면 best 
	 * 실무에서 주석 처리는 누가, 언제, 무엇떄문에의 규칙으로 작성 
	 * ex) 2022/01/10 도서관리 시스템 기본 settung kew 
	 * 주석의종류 블록주석 : 한 영역자체를 간단하게 주석처리
	 * 라인 주석 :
	 */
  
}